In [1]:
import seaborn as sns
import pandas as pd
import numpy as np
import scipy.stats as stats

In [2]:
df = sns.load_dataset('titanic')
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [8]:
df_crosstab=pd.crosstab(df['sex'],df['class'],margins=True)

In [10]:
df_crosstab

class   First  Second  Third  All
sex
female     94      76    144  314
male      122     108    347  577
All       216     184    491  891

In [13]:
stats.chi2_contingency(pd.crosstab(df['sex'],df['class']))

Chi2ContingencyResult(statistic=16.971499095517114, pvalue=0.00020638864348233114, dof=2, expected_freq=array([[ 76.12121212,  64.84399551, 173.03479237],
       [139.87878788, 119.15600449, 317.96520763]]))

In [17]:
p_value=stats.chi2.sf(16.971499095517114,df=2)

In [18]:
c_value=stats.chi2.isf(0.05,df = 2)

In [19]:
alpha = 0.05
if p_value < alpha:
    print('Since p_value is less than alpha,Reject H0 Conclusion :There is significance relationship between Sex And Class variables')
else :
    print('There is no significance relationship between Sex And Class variables')

Since p_value is less than alpha,Reject H0 Conclusion :There is significance relationship between Sex And Class variables

This was our hypothesis
* h0 : gender and class are independent/ there is no relation among gender and class
* h1 : gender and class are dependent/ there is relation among gender and class

since pval(0.0002) < sig_val, we reject H0, hence concluding that
gender and class are dependent,there is a relation between gender and class, 
gender is an imp feature to predics class

In [3]:
df = df[['sex','age','fare','class']]

In [5]:
df.value_counts()

sex     age   fare      class
male    30.0  13.0000   Second    3
        23.0  13.0000   Second    3
        32.0  7.9250    Third     3
        19.0  7.8958    Third     3
        34.0  13.0000   Second    3
                                 ..
female  45.0  164.8667  First     1
        47.0  14.5000   Third     1
              52.5542   First     1
        48.0  25.9292   First     1
male    80.0  30.0000   First     1
Length: 659, dtype: int64

In [6]:
df['age']=df['age'].fillna(df['age'].median())

C:\Users\K\AppData\Local\Temp\ipykernel_38332\206247837.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['age']=df['age'].fillna(df['age'].median())

In [7]:
df

        sex   age     fare   class
0      male  22.0   7.2500   Third
1    female  38.0  71.2833   First
2    female  26.0   7.9250   Third
3    female  35.0  53.1000   First
4      male  35.0   8.0500   Third
..      ...   ...      ...     ...
886    male  27.0  13.0000  Second
887  female  19.0  30.0000   First
888  female  28.0  23.4500   Third
889    male  26.0  30.0000   First
890    male  32.0   7.7500   Third

[891 rows x 4 columns]

# Continous vs Continous

In [8]:
df.head(2)

      sex   age     fare  class
0    male  22.0   7.2500  Third
1  female  38.0  71.2833  First

# Shapiro test

In [ ]:
#we will consider age & Fare to perform this test because both are continous 

#since both are continous we will first check for parametric assumptions

In [9]:
# Hypothesis Formation
# NUll : Data is Normal / skew = 0 
# Altr : Data is Not Normal / skew != 0

In [11]:
stats.shapiro(df['fare'])

ShapiroResult(statistic=0.5218917727470398, pvalue=1.0789998175301091e-43)

In [12]:
stats.shapiro(df['age'])

ShapiroResult(statistic=0.9541053175926208, pvalue=4.652422165814035e-16)

In [ ]:
# Since the p_values of age & fare both are less than sig_level(0.05) we reject
# H0, concluding the data is not Normal.

In [13]:
#Null : Data is having equal variance
#Alt : Data is not having equal variance

In [14]:
stats.levene(df['fare'],df['age'])

LeveneResult(statistic=80.60519993028785, pvalue=6.833244558818894e-19)

In [ ]:
# Since the p_values is less than sig_level(0.05) we reject
# H0, concluding the data is not having equal variance.

In [15]:
#we assume data is normal and having equal variance and we are proceed to perform paramteric test

#Parametric Test

In [16]:
#Pearson R Correlation test

In [17]:
#Null : Fare and age are independent
#Alternate : Fare and age are dependent 

stats.pearsonr(df['age'],df['fare'])

PearsonRResult(statistic=0.09668842218036511, pvalue=0.0038667538638672496)

In [ ]:
alpha = 0.05 

#Since p_value(0.003) is less than significance_level(0.05) we reject H0 , 
#Concluding fare and age are dependent

In [18]:
#SPEARMEN R Correlation test

In [19]:
#Null : Fare and age are independent
#Alternate : Fare and age are dependent 

stats.spearmanr(df['age'],df['fare'])

SignificanceResult(statistic=0.12600552124010062, pvalue=0.00016260974540267112)

In [ ]:
#since p_value(0.0001) is less than significance_level(0.05) we reject H0 ,
#Concluding fare and age are dependent

# Con vs Cat (= 2 sub groups)

In [25]:
#we will perform sex and fare to pefotm the test
df['sex'].unique()

male_fare=df[df['sex']=='male']['fare']

female_fare=df[df['sex']=='female']['fare']

In [26]:
#Null : sex and fare are independent 
#Alternate : Sex and Fare are dependent 


print(stats.shapiro(male_fare))
print(stats.shapiro(female_fare))

# Since the p_values of age & fare both are less than sig_level(0.05) we reject
# H0, concluding the data is not Normal.

ShapiroResult(statistic=0.43366360664367676, pvalue=5.159334317114255e-39)
ShapiroResult(statistic=0.6361146569252014, pvalue=2.580287846596769e-25)

In [28]:
stats.levene(male_fare,female_fare)

# Since the p_values of age & fare both are less than sig_level(0.05) we reject
# H0, concluding the data is not equal variance.

LeveneResult(statistic=19.188225990910503, pvalue=1.3255194429754062e-05)

# Parametric test

In [27]:
#2-Sample t-test

#Null : Gender And Fare are independent 
#Alternate : Gender and Fare are dependent 

stats.ttest_ind(male_fare,female_fare)

# Since the p_values of age & gender both are less than sig_level(0.05) we reject
# H0, concluding the data is not Normal.

Ttest_indResult(statistic=-5.529140269385719, pvalue=4.2308678700429995e-08)

In [29]:
#Non-Parameteric test

#Mannwhitney-U test

#Null : gender and fare are independent
#alternate : gender and fare are dependent 


stats.mannwhitneyu(male_fare,female_fare)

# Since the p_values of age & gender both are less than sig_level(0.05) we reject
# H0, concluding the data is not Normal.

MannwhitneyuResult(statistic=62175.0, pvalue=9.61232696290926e-15)

In [30]:
stats.f_oneway(male_fare,female_fare)

F_onewayResult(statistic=30.57139211854278, pvalue=4.230867870041279e-08)

In [31]:
# Con vs cat (> 2 )

#we will consider fare & class for this test

# Shaprio test

In [35]:
#Null : data are normal
#Alternate : data are not normal

df['class'].unique()

First_class_fare=df[df['class']=='First']['fare']
Second_class_fare=df[df['class']=='Second']['fare']
Third_class_fare=df[df['class']=='Third']['fare']

In [38]:
print(stats.shapiro(First_class_fare))
print(stats.shapiro(Second_class_fare))
print(stats.shapiro(Third_class_fare))

#Since p_value is less than signifiance_level,Reject Ho concluding fare and class are independent

ShapiroResult(statistic=0.7184011936187744, pvalue=7.556290242780962e-19)
ShapiroResult(statistic=0.7785054445266724, pvalue=2.1134194129582328e-15)
ShapiroResult(statistic=0.6183854341506958, pvalue=1.599492812175185e-31)

# Levene Test

In [39]:
#Null : Data is having equal variance
#Alt : Data is not having equal variance

print(stats.levene(First_class_fare,Second_class_fare,Third_class_fare))

#Since p_value is less than signifiance_level,Reject Ho concluding fare and class are
# not having equal variance

LeveneResult(statistic=118.57020037111805, pvalue=2.288618662046418e-46)

# ANOVA

In [40]:
stats.f_oneway(First_class_fare,Second_class_fare,Third_class_fare)

F_onewayResult(statistic=242.34415651744814, pvalue=1.0313763209141171e-84)

In [41]:
#Null : All the means are same
#alternate : atleast of the means are not same 

import statsmodels.stats.multicomp as mc

post_hoc = mc.MultiComparison(data=df['fare'],groups=df['class'])

# tukey test
tukey = post_hoc.tukeyhsd()
tukey.summary()

# kruskal test

In [43]:
#Null : fare and class are independent 
# Alternate :fare and class are dependent

stats.kruskal(First_class_fare,Second_class_fare,Third_class_fare)

#Since p_value is less than signifiance_level,Reject Ho concluding fare and class are
# dependent

KruskalResult(statistic=438.0437034212556, pvalue=7.586096900646798e-96)